% Υποεργασία 4 ερώτημα α
clear;
clc;
format long;

h = 0.05;     % Βήμα στο Χ και Υ άξονα
box = 0.4;    % Μέγιστη τιμή Χ και Υ
n = box/h-1;  % Αριθμός εσωτερικών σημείων

f = @(x,y)(-25*(pi^2)*sin(5*pi*x/2)*sin(5*pi*y/2)); % Η f(x,y) συνάρτηση
an = @(x,y)(sin(5*pi*x/2)*sin(5*pi*y/2)); % Αναλυτική λύση της εξίσωσης


% Κατασκευή πίνακα Α
A = eye(n^2)*(-4-(12.5*(pi^2))*(h^2));   % Γέμισμα κύριας Διαγωνίου 

for i=1:(n^2-1)                        % Γέμισμα ’νω και Κάτω διαγωνίου
    if ~(mod(i,n)==0)
        A(i,i+1) = 1;
        A(i+1,i) = 1;
    end
end

for i=1:n^2-n                          % Γέμισμα των διαγωνίων (i,i+n) και (i+n,i)
    A(i,i+n) = 1; 
    A(i+n,i) = 1;
end

s = zeros(n^2,1);     % Δημιουργία πίνακα S
k = 1;
for i=1:n
    for j=1:n
        s(k)=f(i*h,j*h)*h^2;   % Γέμισμα του S πίνακα με τις κατάληλες τιμές
        k = k+1;
    end
end

u = A\s;                       % Λύση του συστήματος

uu = zeros(n^2,1);
k = 1;
for i=1:n
    for j=1:n
        uu(k) = an(i*h,j*h);   % Εύρεση αναλυτικής λύσης για την σύγκριση
        k = k+1;
    end
end

disp('   Αναλυτική:          Υπολογισθείσα:      Σφάλμα:   ');
disp([uu u abs(u-uu)]);
k=1;
for i=1:n
    for j=1:n
        sah(i,j) = u(k);
        k=k+1;
    end
end
