% Θεώρημα Gerschgorin Circle
% Υποεργασία 2
% α ερώτημα
clear;
clc;
format long;

A = [0 0 2 4; 0.5 0 0 0; 0 0.25 0 0; 0 0 0.125 0];
n = size(A,1); % Μέγεθος πίνακα

for i=1:n
    % Ο κύκλος έχει κέντρο το (h,k) όπου h το πραγματικό μέρος του A(i,i)
    % και k το φανταστικό του μέρος.
    % Ο πίνακάς μας όμως δεν έχει φανταστικό μέρος οπότε k = 0.
    h = real(A(i,i));
    k = 0;
    

    % Υπολογισμός της ακτίνας r του κύκλου.
    r=0;
    for j=1:i-1
           r=r+abs(A(i,j));   
    end
    for j=i+1:n
           r=r+abs(A(i,j));   
    end
    
    % Φτιάχνουμε το διάνυσμα των σημείων για τον κύκλο.
    N=256;
    t=(0:N)*2*pi/N;
    
    % Κάνουμε plot τα στοιχεία του διανύσματος για να κατασκευάσουμε τον
    % κύκλο
    plot( r*cos(t)+h, r*sin(t)+k ,'-');

    % Όπως επίσης και το κέντρο του κύκλου
    hold on;
    plot(h, k,'+');
end

axis equal;

% Βρίσουμε τις ιδιοτιμές του Α και τις κάνουμε plot
ev = eig(A);
for i=1:size(ev)
    rev=plot(real(ev(i)),imag(ev(i)),'ro');
end
hold off;
legend(rev,'Ιδιοτιμές του Α στο μιγαδικό επίπεδο');