function [ u ] = sparse_choleski_parabolic_1D(D,UD,LD,u,nn,mn )

% Η μέθοδος Choleski σε έναν τριδιαγώνιο πίνακα για την επίλυση
% μιας παραβολικής εξίσωσης.
% Δέχεται σαν ορίσματα του πίνακες D,UD,LD οι οποίοι είναι η Κύρια,
% ’νω και κάτω διαγώνιοι αντίστοιχα.
% Οι μεταβλητές nn,mn είναι είναι τα σημεία στο t και x αντίστοιχα.

    n2 = length(D); % μεγεθος πίνακα D
    DL = zeros(1,n2); % Η κύρια διαγώνιος που κάνει η μέθοδος Choleski
    LDL = zeros(1,n2-1); % Η κάτω διαγώνιος
    x = zeros(n2,1);
    y = zeros(n2,1);
    
    % Με κατάληλη τροποποίηση η μέθοδος κάνει μόνο τις απαραίτητες πράξεις
    DL(1,1) = sqrt(D(1,1));
    LDL(1,1) = LD(1,1)/DL(1,1);
    for i=2:(n2-1)
        DL(1,i) = sqrt(D(1,i)-LDL(1,i-1)^2);
        LDL(1,i) = (1/DL(1,i))*(UD(1,i));
    end
    DL(1,n2) = sqrt(D(1,n2)-LDL(1,n2-1)*LDL(n2-1));
    for k=1:nn
        s = u(2:mn-1,k);
        y(1) = s(1)/DL(1,1);
        for i=2:n2
            y(i,1) = (s(i)-LDL(1,i-1)*y(i-1))/DL(1,i);
        end
        x(n2) = y(n2)/DL(1,n2);
        for i=(n2-1):-1:1
            x(i,1) = (y(i,1)-LDL(1,i)*x(i+1,1))/DL(1,i);
        end
        u(2:mn-1,k+1) = x;
    end
    
end

